# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\ikomb\Documents\PSoC Creator\CE216795_DualCoreBlinky01\CE219490_PSoC_6_MCU_Breathing_LED_using_SmartIO01.cydsn\CE219490_PSoC_6_MCU_Breathing_LED_using_SmartIO01.cyprj
# Date: Mon, 26 Jun 2023 10:21:37 GMT
#set_units -time ns
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyClk_HF0} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 500 -waveform {0 250} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {Clock_smartio} -source [get_pins {ClockBlock/periclk}] -edges {1 20203 40405} [list [get_pins {ClockBlock/ff_div_10}]]
create_generated_clock -name {Clock_pwm} -source [get_pins {ClockBlock/periclk}] -edges {1 2001 4001} [list [get_pins {ClockBlock/ff_div_18}]]
create_clock -name {CyPeriClk_App} -period 500 -waveform {0 250} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyFLL} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\ikomb\Documents\PSoC Creator\CE216795_DualCoreBlinky01\CE219490_PSoC_6_MCU_Breathing_LED_using_SmartIO01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\ikomb\Documents\PSoC Creator\CE216795_DualCoreBlinky01\CE219490_PSoC_6_MCU_Breathing_LED_using_SmartIO01.cydsn\CE219490_PSoC_6_MCU_Breathing_LED_using_SmartIO01.cyprj
# Date: Mon, 26 Jun 2023 10:21:27 GMT
