# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\ikomb\Documents\PSoC Creator\CE216795_DualCoreBlinky01\Custom_TickTimer_RTC01.cydsn\Custom_TickTimer_RTC01.cyprj
# Date: Mon, 26 Jun 2023 10:16:14 GMT
#set_units -time ns
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyFLL} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF0} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_clock -name {CyPeriClk_App} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyClk_HF1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk_1}]]
create_clock -name {CyClk_HF2} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk_2}]]
create_clock -name {CyClk_HF3} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk_3}]]
create_clock -name {CyClk_HF4} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk_4}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\ikomb\Documents\PSoC Creator\CE216795_DualCoreBlinky01\Custom_TickTimer_RTC01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\ikomb\Documents\PSoC Creator\CE216795_DualCoreBlinky01\Custom_TickTimer_RTC01.cydsn\Custom_TickTimer_RTC01.cyprj
# Date: Mon, 26 Jun 2023 10:16:03 GMT
